import React, {useEffect, useState} from "react";
import { Link } from 'react-router-dom';
import '../styles/delivery.scss';
function Delivery(){



    return(
        <div className={'col-12'} id={'delivery-container'}>
            <h2>Доставка</h2>
            <div className={"delivery-information-container col-12"}>
                <p>
                    <h3> Доставка кур'єрською службою</h3>

 Наш кур'єр доставить замовлення з 10:00 до 21:00(пн-чт)
 10:00-21:45(пт-нд) протягом однієї години з моменту
 підтвердження замовлення. Доставка безкоштовна за
 умови замовлення від 400 грн. При сумі замовлення
 менше 400 грн. - вартість доставки 60 грн. (в межах
 міста).

 <h3>Доставка у передмістя Житомира</h3>

 Доставка у передмістя складає до 1 години 30 хвилин.
 При сумі замовлення менше 800 грн - вартість доставки
 120 грн. При сумі замовлення більше 800 грн - доставка
 безкоштовна.

 Також у Вас є можливість зробити замовлення на будь-
 яку зручну для Вас дату та час.

 <h3>Самовивіз за адресами</h3>

 Вільський шлях 14, корпус 2. Кафе "Panda Banda" з 10:00
 до 21:00(пн-чт) та з 10:00 до 21:45 (пт-нд).<br />
                </p>
                <a href={'https://www.google.com.ua/maps/place/Panda+Banda+Sushi+%26+Pizza/@50.2791152,28.6462738,16.78z/data=!4m6!3m5!1s0x472c65d03414e94f:0xc21d63d0e088120!8m2!3d50.2791446!4d28.64423!16s%2Fg%2F11j8zckszn?hl=ru&entry=ttu'}  className={'button-map'} target="_blank">
                    Переглянути на карті
                </a>

            </div>

        </div>
    )
}

export default Delivery